[
  {
    "view": "game",
    "layout": "game",
    "author": "reicast",
    "created_at": "2018-03-25 09:00",
    "updated_at": "2019-05-02 09:00",
    "id": "charge-n-blast",
    "title": "Charge 'n Blast",
    "gamedb-issue": 0,
    "releases": [
      {
        "id": "CF2B",
        "region": "EU",
        "version": "1.000",
        "discs": 1,
        "medium": "gdrom"
      },
      {
        "id": "D30A",
        "region": "US",
        "version": "1.000",
        "discs": 1,
        "medium": "gdrom"
      }
    ],
    "test-videos": [
      {
        "fingerprint": "CF2B GD-ROM1/1 EU",
        "title": "Intro auto run",
        "hw": "i7 2720qm, GeForce 540M",
        "yt": "wNCxCA3rLYA",
        "git": "d59197f84353d7d2b746383e9277d9ed7c8c4053",
        "platform": "win86-release"
      },
      {
        "fingerprint": "D30A GD-ROM1/1 US",
        "title": "Intro auto run",
        "hw": "i7 2720qm, GeForce 540M",
        "yt": "KEBRL1founI",
        "git": "d59197f84353d7d2b746383e9277d9ed7c8c4053",
        "platform": "win86-release"
      }
    ],
    "gotIGDBGame": 1,
    "idIGDB": 45822,
    "first_release_date": 983318400,
    "categories": [
      "Shooter"
    ],
    "name": "Charge 'n Blast",
    "popularity": 1,
    "screenshots": [
      {
        "id": 112419,
        "game": 45822,
        "height": 1080,
        "image_id": "dhq5snkgzyt8uingbnko",
        "url": "//images.igdb.com/igdb/image/upload/t_thumb/dhq5snkgzyt8uingbnko.jpg",
        "width": 1440
      }
    ],
    "slug": "charge-n-blast",
    "summary": "Charge 'N Blast is a shooting game where you play as one of three marines who have to rid the earth of alien scum. The gameplay is similar to Cabal, you move left and right dodging enemies while charging up you weapons to blast them away. \nThere are three different marines you can choose from, each with their own set of weapons. As usual there is the balanced character (Johnny Rock), a weaker but faster one (Pamela Hewitt) and a slower but stronger one (Nicholas Woods). \nYou can choose to play in one player mode, time attack or two player mode. The missions are broken up into small areas where you have to kill all enemies before moving on to the next area. Each mission ends with a boss character such as a giant insect or a Godzilla-like monster. \nUse the X, Y or B buttons to choose a weapon, press A to charge and shoot and aim with analog stick. There are different types of weapons that can be used on the different types of enemies. For example the single missiles for far away targets and torpedoes for underwater enemies. \nYou can fire your weapon continuously, but this doesn't do as much damage compared to a fully charged shot. Charging each shot means you have to aim a little more carefully, but you'll especially need this in the later levels. You can dodge enemies with the L and R buttons."
  },
  null
]