[
  {
    "view": "game",
    "layout": "game",
    "author": "reicast",
    "created_at": "2018-03-25 09:00",
    "updated_at": "2019-05-02 09:00",
    "id": "elemental-gimmick-gear",
    "title": "Elemental Gimmick Gear",
    "gamedb-issue": 0,
    "releases": [
      {
        "id": "36D6",
        "region": "US",
        "version": "1.001",
        "discs": 1,
        "medium": "gdrom"
      },
      {
        "id": "1C86",
        "region": "JP",
        "version": "1.000",
        "discs": 1,
        "medium": "gdrom"
      }
    ],
    "test-videos": [
      {
        "fingerprint": "36D6 GD-ROM1/1 US",
        "title": "Intro auto run",
        "hw": "i7 2720qm, GeForce 540M",
        "yt": "mAyuKGbhywA",
        "git": "d59197f84353d7d2b746383e9277d9ed7c8c4053",
        "platform": "win86-release"
      },
      {
        "fingerprint": "1C86 GD-ROM1/1 JP",
        "title": "Intro auto run",
        "hw": "i7 2720qm, GeForce 540M",
        "yt": "AivnD8IsccQ",
        "git": "d59197f84353d7d2b746383e9277d9ed7c8c4053",
        "platform": "win86-release"
      }
    ],
    "gotIGDBGame": 1,
    "idIGDB": 45862,
    "cover": [
      {
        "id": 53902,
        "game": 45862,
        "height": 600,
        "image_id": "nsc05pmowjboauw1c3c3",
        "url": "//images.igdb.com/igdb/image/upload/t_thumb/nsc05pmowjboauw1c3c3.jpg",
        "width": 601
      }
    ],
    "first_release_date": 948240000,
    "categories": [
      "Role-playing (RPG)",
      "Adventure"
    ],
    "tags": [
      "fantasy",
      "steampunk",
      "sci-fi",
      "role playing",
      "adventure"
    ],
    "name": "Elemental Gimmick Gear",
    "popularity": 1,
    "slug": "elemental-gimmick-gear",
    "summary": "Elemental Gimmick Gear is an action role-playing game for the Dreamcast console. Elemental Gimmick Gear uses hand-drawn art in an overhead view during exploration, then switches to 3D graphics during boss battles. \nIn the world of Tokion, a dome-shaped ancient ruin was discovered inside a thick jungle. During excavation, an egg-shaped mecha was found inside the ruins containing a sleeping man. No matter how hard scientists tried, he would not wake up. He was taken to a laboratory along with the machine to be further studied. \nUpon analyzing the machine, they learned that it was over 5000 years old. They also could not find any form of power source. In time, the machine became known as &quote;Elemental Gimmick Gear&quote;, or EGG for short. After extensive scientific analysis over a number of years, copies of the EGG were produced and used as vehicles. \n100 years later, the ruin suddenly became active, extending a multitude of tentacles into the ground. They spread all across the land, destroying anything in their way. With the tentacles came a thick layer of fog that surrounded the ruins, and people gave them the name Fogna. \nAt the same time, the Sleeper who was discovered a century prior finally awoke. He had not aged a day since his discovery and had no memory of his past or his own name. Selen, who was with him as he woke, set him free without notifying the other scientists in the lab. She sent him to Fogna to begin searching for clues of what happened 5100 years ago, and to stop the tentacles' breeding."
  },
  null
]