[
  {
    "id": 45830,
    "cover": {
      "id": 28050,
      "game": 45830,
      "height": 1429,
      "image_id": "or3msxfxiekmhhjo8n6i",
      "url": "//images.igdb.com/igdb/image/upload/t_thumb/or3msxfxiekmhhjo8n6i.jpg",
      "width": 1429
    },
    "first_release_date": 1002931200,
    "genres": [
      {
        "id": 4,
        "name": "Fighting"
      }
    ],
    "name": "Capcom Vs SNK 2 Millionaire Fighting 2001",
    "popularity": 1.636240014073141,
    "slug": "capcom-vs-snk-2-millionaire-fighting-2001",
    "summary": "Capcom vs. SNK 2: Mark of the Millennium 2001, known in Japan as Capcom vs. SNK 2: Millionaire Fighting 2001 (カプコン バーサス エス・エヌ・ケイ 2 ミリオネア ファイティング 2001 Kapukon bāsasu Esu-enu-kei Tsū: Mirionea Faitingu Tsū Sausando Wan?), is the sequel to the fighting game Capcom vs. SNK. It was originally released on NAOMI hardware in arcades. As in the original, players select a team of fighters from various Capcom and SNK games then fight other teams, winning each battle by defeating all the opponents from the other team. \n \nAspects of the first game were tweaked, including the Ratio system. In contrast to the fixed system of the original, players can now freely select characters and assign each of them a number from one to four (or \"Ratio\") determining their relative strength, adding up to a maximum team ratio of four. Teams can now consist of a maximum of three characters, as opposed to four in the first game. Additional characters were added, including more characters from Capcom and SNK titles outside of the Street Fighter and King of Fighters series. The Groove system from Millennium Fight 2000 has been augmented to include four new systems of play based on various Capcom and SNK fighting games. In addition, the number of buttons has been increased from the Neo Geo standard of four to the six button system first seen in Capcom\u0027s Street Fighter. \n \nThe game was initially ported to the Sega Dreamcast, followed by a version for the PlayStation 2. The GameCube and Xbox received an updated version titled Capcom vs. SNK 2 EO, with the \"EO\" referring to \"Easy Operation\", a game option intended for novices to the game. The PS2 version was later released on PlayStation Network in July 2013.[2]"
  }
]