[
  {
    "id": 7860,
    "age_ratings": [
      {
        "id": 4609,
        "rating": 8
      },
      {
        "id": 23830,
        "rating": 1
      }
    ],
    "aggregated_rating": 55.0,
    "aggregated_rating_count": 3,
    "cover": {
      "id": 8266,
      "game": 7860,
      "height": 242,
      "image_id": "ojhkoxk81tcxxqkvpoq2",
      "url": "//images.igdb.com/igdb/image/upload/t_thumb/ojhkoxk81tcxxqkvpoq2.jpg",
      "width": 242
    },
    "first_release_date": 914371200,
    "game_modes": [
      {
        "id": 1,
        "name": "Single player"
      }
    ],
    "genres": [
      {
        "id": 8,
        "name": "Platform"
      },
      {
        "id": 31,
        "name": "Adventure"
      }
    ],
    "keywords": [
      {
        "id": 390,
        "name": "parkour"
      },
      {
        "id": 509,
        "name": "fishing"
      },
      {
        "id": 1186,
        "name": "multiple protagonists"
      },
      {
        "id": 2016,
        "name": "billiards"
      },
      {
        "id": 2049,
        "name": "platformer"
      },
      {
        "id": 2184,
        "name": "talking animals"
      },
      {
        "id": 2800,
        "name": "adventure game"
      },
      {
        "id": 4176,
        "name": "animal protagonists"
      },
      {
        "id": 4359,
        "name": "polygonal 3d"
      },
      {
        "id": 4459,
        "name": "eggmobile"
      },
      {
        "id": 4471,
        "name": "multiple storylines"
      },
      {
        "id": 4586,
        "name": "color separation"
      },
      {
        "id": 4711,
        "name": "sprinting"
      },
      {
        "id": 4907,
        "name": "gloves"
      },
      {
        "id": 4943,
        "name": "ring"
      },
      {
        "id": 5193,
        "name": "hub world"
      },
      {
        "id": 5279,
        "name": "theme song"
      },
      {
        "id": 5633,
        "name": "xbox one backwards compatibility"
      },
      {
        "id": 5687,
        "name": "franchise reboot"
      },
      {
        "id": 5915,
        "name": "letter grade at the end of a level"
      },
      {
        "id": 6015,
        "name": "multi-species roster"
      },
      {
        "id": 6196,
        "name": "freelc"
      },
      {
        "id": 7600,
        "name": "playstation 3"
      },
      {
        "id": 11350,
        "name": "adaptation"
      },
      {
        "id": 17215,
        "name": "ps3"
      },
      {
        "id": 21978,
        "name": "sonic adventure"
      },
      {
        "id": 21979,
        "name": "sonic adventure game"
      }
    ],
    "name": "Sonic Adventure",
    "player_perspectives": [
      {
        "id": 2,
        "name": "Third person"
      }
    ],
    "popularity": 2.950092700445133,
    "screenshots": [
      {
        "id": 9243,
        "game": 7860,
        "height": 1200,
        "image_id": "lmjcsybdyn1vhtq5dxsq",
        "url": "//images.igdb.com/igdb/image/upload/t_thumb/lmjcsybdyn1vhtq5dxsq.jpg",
        "width": 3200
      },
      {
        "id": 9244,
        "game": 7860,
        "height": 720,
        "image_id": "v2ucxiubtojgx9lkwgjn",
        "url": "//images.igdb.com/igdb/image/upload/t_thumb/v2ucxiubtojgx9lkwgjn.jpg",
        "width": 1280
      },
      {
        "id": 9245,
        "game": 7860,
        "height": 768,
        "image_id": "zqmfkpq5v7jpscnji3ty",
        "url": "//images.igdb.com/igdb/image/upload/t_thumb/zqmfkpq5v7jpscnji3ty.jpg",
        "width": 1024
      }
    ],
    "slug": "sonic-adventure",
    "storyline": "Sonic Adventure is set on Angel Island, an island floating above Earth. The Ancient Echidna Tribe\u0027s ruler, Pachacamac, plans for world domination. His daughter Tikal enters a shrine, discovering the Chaos Emeralds and the Master Emerald, a group of mysterious emeralds with unlimited power. She befriends a peaceful entity known as Chaos, the guardian of the emeralds, as well as the Chao. Despite warnings from Tikal, Pachacamac and the tribe attack the shrine, attempting to use the emeralds for their own gain. However, Chaos transforms into Perfect Chaos and kills them. Following Chaos\u0027 attack, Tikal seals the entity and herself inside the Master Emerald. \n \nThree thousand years later, Knuckles the Echidna guards the Master Emerald on the floating Angel Island when the evil scientist Doctor Ivo \"Eggman\" Robotnik shatters the Master Emerald and sets Chaos free. As a result, Angel Island plunges into the sea, causing the Master Emerald\u0027s shards and the seven Chaos Emeralds to be scattered. Resolving to search for the shards of the Master Emerald, Knuckles sets off. In the city of Station Square, Sonic the Hedgehog battles Chaos after witnessing an attack by the police. Miles \"Tails\" Prower tests his Chaos Emerald-powered airplane, only to crash on the beach of Emerald Coast. After Sonic rescues Tails, they go to his workshop in the Mystic Ruins, where they are confronted by Eggman. The mad scientist uses Tails\u0027 Emerald to transform Chaos and he reveals his ultimate plan: with the power harnessed from the Emeralds, Chaos will eventually become invincible and destroy Station Square and Eggman will build Robotnikland over the city\u0027s ruins. Sonic and Tails resolve to search for the emeralds to prevent Eggman from getting them first, but eventually lose the ones they find to Eggman and Chaos. Eggman escapes in his airship, the Egg Carrier, and shoots down Sonic and Tails\u0027 pursuing plane. \n \nEggman activates E-102 Gamma and fights E-101 Beta during his training. He orders the rest of the E-Series robots to search for Froggy, a frog who has eaten Chaos\u0027s tail as well as a Chaos Emerald. Gamma finds Froggy but is chased back to the ship by Froggy\u0027s owner Big the Cat. After his crash, Tails finds another emerald and uses it to prepare the Tornado II plane to find Sonic while Sonic lands in Station Square once again. While lamenting her time with Sonic, Amy Rose discovers a Flicky bird in possession of a Chaos Emerald and names him Birdie. However, Eggman, having discovered Birdie\u0027s location, dispatches his robot Zero to chase the Flicky down. After Sonic turns down an offer to protect Birdie, Zero captures Amy and Birdie and detains them both on the Egg Carrier, with Sonic and Tails using the Tornado II to follow them on board. Knuckles also boards the aircraft after collecting pieces of the Master Emerald and seeing an image of the Egg Carrier in the emerald. \n \nOn board the Egg Carrier, Eggman calls out the E-Series robots for their failure and removes them before stationing Gamma in Amy\u0027s cell. However, Gamma witnesses Beta being rebuilt and Amy convinces Gamma that he should not work for Eggman, as he is an enemy. In a confusion of newly discovered emotions, Gamma releases Amy and Birdie. While being chased by Zero, Amy goes to the ship\u0027s deck. She meets up with Sonic and Tails, but Eggman appears and steals Birdie\u0027s emerald, dispatching Gamma to attack Sonic. Sonic damages Gamma, but Amy intervenes and asks Sonic to spares him. Gamma, understanding that Eggman is an enemy, decides to follow the others. The ship loses altitude and Tails, Amy, and Gamma flee, while Sonic restores the ship to its original form. Sonic is confronted by Chaos, now with six Chaos Emeralds and his tail restored, and defeats it once more before pursuing Eggman. Meanwhile, Big retrieves Froggy from inside Chaos before finding the Tornado II, and Knuckles steals back the six Chaos Emeralds; they both flee from the ship as it crashes. \n \nUpon erasing his master registration, Gamma resolves to track down his brother robots. After freeing the animals inside the robots, he goes to the Egg Carrier and confronts Beta, in his rebuilt form. Gamma defeats him, but the fight also causes Gamma to be destroyed, with Birdie\u0027s parents being released from within the two. Returning to the Egg Carrier, Amy reunites Birdie with its family, but she is confronted by Zero after he knocks down the Flicky. Amy defeats the robot and sees Birdie and his family off, vowing to do her best. Elsewhere, Tails chases Eggman and stops him from detonating a missile in the middle of Station Square. Eggman resorts to using the Egg Walker to try and level the city, but is again defeated by Tails. Later, Sonic confronts the mad scientist in his Egg Viper and destroys it. \n \nA day following Eggman\u0027s defeats, Knuckles restores the shards of the Master Emerald, but Angel Island collapses into the sea once again when Chaos attacks him and Eggman. Chaos absorbs the 6 Chaos Emeralds and locates the seventh aboard the Tornado II, which crashed after Big used it to escape the Egg Carrier. With all the Chaos Emeralds, Chaos transforms into Perfect Chaos, draining the Chaos Emeralds of their negative energy, and destroys Station Square in a massive flood. The Chaos Emeralds are re-gathered by Tails, Knuckles, Amy, Big, and the pink Flicky that fueled Gamma. They bring the emeralds to Sonic. \n \nTikal appears, having taken each main character into the past numerous times beforehand, demanding that Chaos must be sealed back in the Master Emerald. Sonic objects, saying that Chaos\u0027s heart would still be filled with anger and sadness if he were to be sealed inside the Master Emerald. Instead, with the cheering of his friends and the people of Station Square, Sonic uses the Chaos Emeralds\u0027 still-present positive energy to become Super Sonic and face off against Perfect Chaos. Following his defeat, Chaos discovers that the Chao thrive in Station Square, quelling his anger. United with Tikal, Chaos ascends into the heavens and disappears. The game ends with Sonic chasing after a fleeing Eggman.",
    "summary": "Sonic Adventure is a platform game in which the player controls six different characters: Sonic the Hedgehog, Miles \"Tails\" Prower, Knuckles the Echidna, Amy Rose, Big the Cat, and E-102 Gamma. They must stop Doctor Eggman from stealing the seven Chaos Emeralds and feeding them to Chaos, a monster known as \"the God of Destruction\". The first in the Sonic the Hedgehog series to feature free-roaming 3D gameplay, Sonic Adventure features two game modes: Adventure and Trial. There are different goals for each character in the game: Sonic involves high speed gameplay, while Tails must reach the end of the level before Sonic does, and Knuckles searches the area for shards of the Master Emerald. Each of the three characters retain many of their trademark moves from previous Sonic games, such as Tails being able to fly for short periods of time, and Knuckles being able to glide through the air, though they can use updated techniques as well. The rest of the playable cast is rounded out by Amy, who must use her hammer to escape from Eggman\u0027s E-100 Zero robot chasing after her, Gamma, who must use its laser beam to shoot through levels to reach a target, and Big, who fishes in efforts to find his friend, Froggy. \n \nThe \"Adventure Mode\" is a one-player game which consists of two areas, the \"Adventure Field\" and an \"Action Stage\". The Adventure Field contains several \"Events\" that are encountered in the course of the story, while the Action Stages have each character fulfilling a goal to clear the stage. Players may also find hidden Chao Gardens, a protective environment inhabited by Chao, a sort of virtual pet. The player can hatch, raise and interact with a Chao. Chao can be taken with the player by downloading the minigame Chao Adventure to their VMU, or in the GameCube version, a Game Boy Advance with Sonic Advance or various other Game Boy Advance Sonic games. The player can also raise their stats by giving them small animals that they found by defeating the robots, which improves their performance in Chao Races. There are also eggs hidden throughout the Adventure Fields which can produce special types of Chao. \n \nBy playing through Action Stages and Subgames, searching through the Adventure Fields or winning Chao Races, players can earn Emblems. In the case of Action Stages, each one has three Emblems, which can be earned by replaying the stages and fulfilling certain objectives, such as beating the level within a time limit.",
    "videos": [
      {
        "id": 3811,
        "game": 7860,
        "name": "Game intro",
        "video_id": "lO6Tc2xaAwE"
      },
      {
        "id": 3812,
        "game": 7860,
        "name": "Gameplay video",
        "video_id": "A2wzZt9SVuA"
      },
      {
        "id": 17862,
        "game": 7860,
        "name": "Gameplay video",
        "video_id": "bo45qMv2HAg"
      }
    ]
  }
]